mhoikka/RCtransmitter_stm32f0/src/Peripheral_Init.c
#include <stdio.h>
#include "stm32f0xx_conf.h"
#include "stm32f0xx_i2c.h"
#include "bme280.h"
#include "bme280_defs.h"
#include "stm32f0xx_spi.h"
#include "Peripheral_Init.h"
#include <string.h>

typedef struct my_device_context {
    I2C_InitTypeDef *I2C_InitStruct; // Pointer to the I2C handle
    uint16_t i2c_address;     // I2C address of the device
} my_device_context;
struct my_device_context ctx = {};
struct bme280_dev bme280_initparam;
struct bme280_data bme280_datastruct;

uint8_t NUM_REGISTERS_BME280 = 4;

// NRF24L01+ REGISTERS
uint8_t CONFIG = 0x00;
uint8_t CONFIG_SETTINGS = 0x00;
uint8_t ENAA = 0x01;
uint8_t SETUP_AW = 0x03;
uint8_t RF_SETUP = 0x06;
uint8_t RX_ADDR_P0 = 0x0A;
uint8_t RX_PW_P0 = 0x11;
uint8_t TX_ADDR = 0x10;
uint8_t FEATURE = 0x1D;
uint8_t WRITE_COMMAND = 0x20;
uint8_t WRITE_PAYLOAD_COMMAND = 0xA0; 
uint8_t WRITE_PAYLOAD_NOACK = 0xB0;
uint8_t READ_PAYLOAD_COMMAND = 0x60;
uint8_t READ_COMMAND = 0x00;
uint8_t STATUS_REG = 0x07;
uint8_t FLUSH_TX = 0xE1;

uint8_t NO_ACK = 0;
uint8_t ACK = 1;

// ICM20948 REGISTERS
static uint8_t ICM_20948_I2C_ADDRESS = 0x68;
static uint8_t REG_BANK_SEL = 0x7F;
static uint8_t USER_BANK_0 = (0 << 4);
static uint8_t USER_BANK_1 = (1 << 4);
static uint8_t USER_BANK_2 = (2 << 4);
static uint8_t USER_BANK_3 = (3 << 4);

// REGISTER BANK 2
static uint8_t LP_CONFIG = 0x05;
static uint8_t PWR_MGMT_1 = 0x06;
static uint8_t PWR_MGMT_2 = 0x07;
// REGISTER BANK 2
static uint8_t TEMP_CONFIG = 0x53; 
static uint8_t GYRO_SMPLRT_DIV = 0x00;
static uint8_t GYRO_CONFIG_1 = 0x01;
static uint8_t GYRO_CONFIG_2 = 0x02;
static uint8_t ACCEL_SMPLRT_DIV = 0x10;
static uint8_t ACCEL_CONFIG = 0x14;
static uint8_t ACCEL_CONFIG_2 = 0x15;
static uint8_t GYRO_ACCEL_START_REG = 0x2D; // ACCEL_XOUT_H register

static uint8_t MAG_START_REG = 0x11;
/**
 * @brief  Delay function for BME280 drivers.
 * @param  usec: specifies the delay time length, in 1 microsecond.
 * @retval None
 */
void __attribute__((optimize("O0"))) delay_microseconds(uint32_t usec, void *intf_ptr){
  for(volatile uint32_t counter = 0; counter < usec; counter++){
    //do nothing NOP instructions
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();
    // this is nearly perfect timing
  }
}

/**
 * @brief Reads from the I2C bus
 *  @param reg_addr: Address of the first register, where data is going to be read
 * @param reg_data: Pointer to data buffer to store the read data
 * @param cnt: Number of bytes of data to be read
 * @param intf_ptr: Pointer to the interface pointer
 * @retval 0 if successful, 1 if not
 */
int8_t BME280_I2C_bus_read(uint8_t reg_addr, uint8_t *reg_data, uint32_t cnt, void *intf_ptr){
	// Send the register address to the sensor
	// This is essentially a partial write operation
  uint32_t dev_addr = BME280_I2C_ADDR_SEC;
	I2C1->CR2 = (dev_addr << 1) | (I2C_CR2_START) | (1 << 16) | (I2C_CR2_AUTOEND);
	I2C1->TXDR = reg_addr; 

  // Wait for not busy
  while (!(I2C1->ISR & I2C_ISR_BUSY)){};

	while ((I2C1->ISR & I2C_ISR_BUSY)){};

	I2C1->CR2 = (dev_addr << 1) | (I2C_CR2_START) | (cnt << 16) | (I2C_CR2_RD_WRN) | (I2C_CR2_AUTOEND);

	// Transfer all the data
    for (int i = 0; i < cnt; i++) {
        // Wait for RXNE
        while (!(I2C1->ISR & I2C_ISR_RXNE));
        reg_data[i] = I2C1->RXDR;
    }


	// Wait for not busy
  while (!(I2C1->ISR & I2C_ISR_BUSY)){};
	while ((I2C1->ISR & I2C_ISR_BUSY)){};
	// Return the status of the read operation

	return 0; // BME OK
}

/**
 * @brief Writes to the I2C bus
 * @param reg_addr: Address of the first register, where data is going to be written
 * @param reg_data: Pointer to data buffer that stores the data to be written
 * @param cnt: Number of bytes of data to be written
 * @param intf_ptr: Pointer to the interface pointer
 * @retval 0 if successful, 1 if not
 */
int8_t BME280_I2C_bus_write(uint8_t reg_addr, const uint8_t *reg_data, uint32_t cnt, void *intf_ptr){
  uint32_t dev_addr = BME280_I2C_ADDR_SEC;
	I2C1->CR2 = (dev_addr << 1) | (I2C_CR2_START) | (cnt*2 << 16) | (I2C_CR2_AUTOEND);
	// transfer cnt bytes of data one register data byte and register address byte pair at a time
	// register address is not auto-incremented
	if (cnt <= NUM_REGISTERS_BME280){
		for(int i = 0; i < cnt; i++){
			// send the register address as a the control byte and the register data as a data byte
			I2C1->TXDR = reg_addr;
			while(!(I2C1->ISR & I2C_ISR_TXE));
			I2C1->TXDR = reg_data[i];
			// increment register address manually
			++reg_addr;
			while(!(I2C1->ISR & I2C_ISR_TXE));
		}
	// Wait for not busy
  while (!(I2C1->ISR & I2C_ISR_BUSY)){};
	while ((I2C1->ISR & I2C_ISR_BUSY)){};
	return 0;
	}
	else{
		return 1;
		//TODO Create an error function here? Maybe?
	}
}

/**
 * @brief enable the GPIO pins to control the H-bridge for the AC 3-phase motor voltage
 * @retval None
 */
void HBridge_Peripherals_Init(){
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOD, ENABLE); // TODO collect all clock enables at start of program

  // Enable pins to control NMOS H-Bridge
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_3 | GPIO_Pin_4;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOB, &GPIO_InitStruct);

  GPIO_InitTypeDef GPIO_InitStruct2;
  GPIO_InitStruct2.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStruct2.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct2.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct2.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct2.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOC, &GPIO_InitStruct2);

  GPIO_InitTypeDef GPIO_InitStruct3;
  GPIO_InitStruct3.GPIO_Pin = GPIO_Pin_2;
  GPIO_InitStruct3.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct3.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct3.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct3.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOD, &GPIO_InitStruct3);
}

/**
 * @brief Initializes all of the peripherals necessary to control the servo motors using the STM32 chip
 * @retval None
 */
void Servo_Peripherals_Init(){

