mhoikka/RCtransmitter_stm32f0/src/Peripheral_Init.c
  ADC_ChannelConfig(ADC1, ADC_Channel_11, ADC_SampleTime_239_5Cycles);
  // Perform a dummy conversion after switching channel so the sample-and-hold can settle,
  // otherwise the first conversion may still reflect the previous channel.
  ADC_StartOfConversion(ADC1);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
  (void)ADC_GetConversionValue(ADC1); // discard dummy result

  ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
  delay_microseconds(32, NULL);

  ADC_StartOfConversion(ADC1);
  while(ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
  adc_readings[1] = ADC_GetConversionValue(ADC1);
  
  ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
  delay_microseconds(32, NULL);

  ADC_ChannelConfig(ADC1, ADC_Channel_12, ADC_SampleTime_239_5Cycles);
  // dummy conversion after channel switch for stability
  ADC_StartOfConversion(ADC1);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
  (void)ADC_GetConversionValue(ADC1); // discard dummy result

  ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
  delay_microseconds(32, NULL);

  ADC_StartOfConversion(ADC1);
  while(ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
  adc_readings[2] = ADC_GetConversionValue(ADC1);
  return adc_readings;
}

/**
 * @brief Takes a single ADC reading from ADC0 (PA0)
 * @retval 1 12-bit ADC reading in unsigned integer format, in a 16 bit integer package padded with 0s on the MSB side
 */
uint16_t ADC_take_BatteryReading(uint16_t adc_reading){ // TODO switch to using ADC_take_Multiple_Readings
  // Read single ADC channel ADC0 (PA0)

  // make sure ADC peripheral clock was enabled earlier:
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE); // safe to call if already enabled
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);  // enable GPIOA for PA0

  // Configure PA0 as analog input
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP; // kept from existing style
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIO_InitStruct);

  // Enable ADC and wait until ADEN is set
  ADC_Cmd(ADC1, ENABLE);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_ADEN) == RESET) {
    /* wait for ADC ready */
  }

  // Configure channel 0 (PA0)
  ADC_ChannelConfig(ADC1, ADC_Channel_0, ADC_SampleTime_239_5Cycles);

  // Start conversion and wait for completion
  ADC_StartOfConversion(ADC1);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
  adc_reading = ADC_GetConversionValue(ADC1);

  // Clear EOC flag (safe to do)
  ADC_ClearFlag(ADC1, ADC_FLAG_EOC);

  return adc_reading;
}

/**
 * @brief Converts ADC measurement to voltage value of battery taking the voltage divider into account
 * @param ADC_12bit 12 bit measurement from ADC in unsigned integer format, in a 16 bit integer package padded with 0s on the MSB side
 * @retval Battery voltage
 */
float batteryVoltageMeasurement(uint16_t ADC_12bit){
  float Rtop = 300000;
  float Rbottom = 100000;
  float battery_voltage;
  battery_voltage = ADC_12bit * 3.3 * (Rbottom + Rtop) / (Rbottom * 0xFFF); // TODO document this equation
  return battery_voltage;
}

/**
 * @brief Repeatedly cycle the control signals for the H-bridge to control the AC voltage for the electric motor (square waves, three phase AC)
 * @param Period The period of the on-off control signal cycle in microseconds
 * @retval None
 */
void DriveACMotorVoltageController(uint32_t Period){

  uint32_t halfPeriod = Period/2;
  uint32_t thirdPeriod = Period/3;
  uint32_t sixthPeriod = Period/6;
  
  while(TRUE){ // TODO test if there should be a time delay between S1 turning off and S2 turning on and vice versa (there should be a GPIO pin voltage rise and fall time of 125 ns max)
    GPIO_SetBits(GPIOB, GPIO_Pin_6); // S1 on

    delay_microseconds(sixthPeriod, NULL); // 1/6 period elapsed 
    GPIO_ResetBits(GPIOD, GPIO_Pin_2); // S5 off
    GPIO_SetBits(GPIOC, GPIO_Pin_11); // S6 on

    delay_microseconds(thirdPeriod-sixthPeriod, NULL); // 1/3 period elapsed (delay timings are computed like this to avoid rounding errors from integer division truncations)
    GPIO_ResetBits(GPIOB, GPIO_Pin_3); // S4 off
    GPIO_SetBits(GPIOB, GPIO_Pin_4); // S3 on

    delay_microseconds(halfPeriod - thirdPeriod, NULL); // 1/2 period elapsed
    GPIO_ResetBits(GPIOB, GPIO_Pin_6); // S1 off
    GPIO_SetBits(GPIOB, GPIO_Pin_5); // S2 on

    delay_microseconds(2*thirdPeriod - halfPeriod, NULL); // 2/3 period elapsed
    GPIO_ResetBits(GPIOC, GPIO_Pin_11); // S6 off
    GPIO_SetBits(GPIOD, GPIO_Pin_2); // S5 on

    delay_microseconds(sixthPeriod, NULL); // 5/6 period elapsed
    GPIO_ResetBits(GPIOB, GPIO_Pin_4); // S3 off
    GPIO_SetBits(GPIOB, GPIO_Pin_3); // S4 on
    
    delay_microseconds(Period-(sixthPeriod+2*thirdPeriod), NULL); // Full period elapsed
    GPIO_ResetBits(GPIOB, GPIO_Pin_5); // S2 off
  }
}

/**
 * @brief  Initializes the I2C1 communication
 * @retval None
 */
void I2C_Settings_Init(){

  // Enable peripheral clock
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);

  // Use pins PB8 and PB9 for I2C (STM32F030R8T6)
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource8, GPIO_AF_1);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource9, GPIO_AF_1);
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz; 
  GPIO_InitStruct.GPIO_OType = GPIO_OType_OD;
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(GPIOB, &GPIO_InitStruct);
	
  // I2C configuration
  I2C_InitTypeDef I2C_InitStruct;
  I2C_InitStruct.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStruct.I2C_AnalogFilter = I2C_AnalogFilter_Enable;
  I2C_InitStruct.I2C_DigitalFilter = 0x00;
  I2C_InitStruct.I2C_Timing = 0x00901D23; // TODO recheck these values if I2C issues occur
  I2C_Init(I2C1, &I2C_InitStruct);
  I2C_Cmd(I2C1, ENABLE);

  ctx.I2C_InitStruct = &I2C_InitStruct;
  ctx.i2c_address = 0x68; // TODO replace this address with the bme280 address or remove if unnecessary
}

/**
 * @brief Transmits a single byte over I2C
 * @param i2c_address 7 bit I2C address of the slave device
 * @param i2c_data byte of data to be transmitted
 * @retval None
 */
void I2C_transmit(uint8_t i2c_address, uint8_t reg_address, uint8_t i2c_data){
  // Wait until bus is idle
  while (I2C1->ISR & I2C_ISR_BUSY);

