mhoikka/RCtransmitter_stm32f0/src/Peripheral_Init.c
        while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

        // Read received byte (not used, but necessary to complete the transaction) 
        (void)SPI1->DR; 
    }

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
}

/** 
* @brief: Clear TX FIFO
*/
void nrf24_clear_TX(){
    uint8_t txData[1]; // Transmit data buffer

    // Prepare command to write (register address with write command prefix)
    txData[0] = FLUSH_TX; // Write command

    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    // Start SPI transmission
    for (int i = 0; i < 1; i++) {
        // Transmit byte
        *(__IO uint8_t*)(&SPI1->DR) = txData[i]; 

        // Wait until transmission is complete
        while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

        // Read received byte (not used, but necessary to complete the transaction) 
        (void)SPI1->DR; 
    }

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
}

void test_nrf24_connection() {
    // int success = 0;
    set_nrf24_SPI_CSN(1); //make sure these pins are at the right level
    set_nrf24_SPI_CE(0);
    delay_microseconds(100000, NULL); //Let the chip power up and down
    /*
    uint8_t configValue = nrf24_read_register(STATUS_REG); 
    nrf24_write_register(STATUS_REG, CONFIG_SETTINGS); 
    
    uint8_t configValue2 = nrf24_read_register(STATUS_REG); 

    //set_nrf24_SPI_CE(1); //enables chip to receive data
    //Delay(2);

    // Check if expected bits are set
    if ((configValue & CONFIG_SETTINGS) == CONFIG_SETTINGS) {
        success = 1;
    }*/ 
}

uint8_t ADDRESS_LEN = 3;
/** 
* @brief: transmits data for testing purposes
* @param: data: array of data to be transmitted, up to 32 bytes long
* @param: data_len: length of the data to be transmitted
*/
 //TODO make this much more functional
void transmitBytesNRF(uint8_t * data, uint8_t data_len) {
    uint8_t write_address [3] = {0x93, 0xBD, 0x6B};
    
    // Clear TX FIFO
    nrf24_clear_TX();
    nrf24_write_register(STATUS_REG, 0x30); // Clear MAX_RT and TX Data Sent bit from status register
    nrf24_write_register(ENAA, 0x01); // Enable auto ack for pipe 0 //ALL PIPES 0x3F

    // Set control registers
    nrf24_write_register(SETUP_AW, 0x01); // Set to 3 byte address width
    nrf24_multiwrite_register(TX_ADDR, write_address, ADDRESS_LEN); // Set write address
    nrf24_multiwrite_register(RX_ADDR_P0, write_address, ADDRESS_LEN); // Set read address
    //nrf24_write_register(RF_SETUP, 0x00); // Set RF Data Rate to 1Mbps, RF output power to -18dBm
    //CHANGE POWER TO MAX 0dBm TEST
    nrf24_write_register(RF_SETUP, 0x07);
    nrf24_write_register(RX_PW_P0, 0x20); // Set payload size to 32 bytes
    
    nrf24_write_register(FEATURE, 0x01); // Enable W_TX_PAYLOAD_NOACK command

    nrf24_write_TX_payload(data, ACK, data_len);            // Write data to be transmitted into TX FIFO
    set_nrf24_SPI_CE(1);                  // Enable chip to transmit data
    delay_microseconds(130, NULL); // Wait for chip to go into TX mode
    delay_microseconds(15, NULL);    // Not sure how long this delay needs to be TODO test this

    set_nrf24_SPI_CE(0); // Disable chip after transmission
    delay_microseconds(8*32, NULL); // TODO Adjust wait time for different packet sizes
}

/** 
* @brief: transmits data for testing purposes
* @param: data: array of data to be transmitted
* @param: data_len: length of the data array to be transmitted in units of data size
* @param: data_size: size of the data type to be transmitted in bytes
*/
void transmit(void * data, uint8_t data_len, uint8_t data_size){ 
  // Data_size must divide data_len and 32 without a remainder and be at least 1
  if (data_len % data_size != 0 || 32 % data_size != 0 || data_size < 1){
    return;
  }
  int i = 0;
  int len_left = 0;
  uint8_t data_seg[32];
  //uint8_t data_send[32];
  nrf24_write_register(CONFIG, 0x0A);         // Set to PTX mode and turn on power bit 0x0A
  delay_microseconds(2*1000, NULL);  // Wait for chip to go into Standby-I mode
  
  while(data_len > 0){
    len_left = ((data_len*data_size) >= 32) ? 32 : (data_len*data_size)%32; 
    memcpy(&data_seg[0], (const unsigned char *)data + i, len_left); // Mini array of length 32 for buffering transmitted data

    transmitBytesNRF(data_seg, len_left);

    //while(!(SPI1->SR & ((uint16_t)(1 << 5)))); // Wait for TX_DS bit to be set from ACK received// TODO don't know if this is working
    if (data_len * data_size > 32) {
      data_len -= 32 / data_size;
    } else {
      data_len = 0; 
    }

    i+=32/data_size;
  }
  

  //
  uint16_t bytes_left = data_len * data_size;
  uint8_t* ptr = data;

  while (bytes_left > 0) {
      uint8_t chunk = bytes_left >= 32 ? 32 : bytes_left;
      memcpy(data_seg, ptr, chunk);

      transmitBytesNRF(data_seg, chunk);

      ptr += chunk;
      bytes_left -= chunk;
  }
}

/**
 * @brief  Controls the CSN pin for the NRF24LO1+ module. Active low
 * @retval None
 */
void set_nrf24_SPI_CSN(uint8_t input){
  while (SPI1->SR & SPI_SR_BSY); // Wait until SPI is not busy
  if(input == 1){
    (GPIOA->BSRR = GPIO_BSRR_BS_4);
  }
  else{
    delay_microseconds(5, NULL); // Makes sure CSN doesn't go low too quickly after last SPI operation
    (GPIOA->BSRR = GPIO_BSRR_BR_4);
  }
}

/**
 * @brief  Enables the CE pin for the NRF24LO1+ module. Active low
 * @retval None
 */
void set_nrf24_SPI_CE(uint8_t input){
  if(input == 1){
    (GPIOA->BSRR = GPIO_BSRR_BS_9);
  }
  else{
    delay_microseconds(5, NULL); // Makes sure CE doesn't go low too quickly after last SPI operation TODO check if this is necessary
    (GPIOA->BSRR = GPIO_BSRR_BR_9);
  }
}

/**
 * @brief Initializes the SPI connection for the STM32F030R8
 * @retval None
 */
void MySPI_Init(){
  //Set up the SPI peripheral
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE); // TODO CHECK IF THIS IS ALREADY ENABLED
  GPIO_InitTypeDef GPIO_InitStruct;
  SPI_InitTypeDef SPI_InitStruct;
  
  //GPIO_PinAFConfig(GPIOA, GPIO_PinSource4, GPIO_AF_0);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource5, GPIO_AF_0);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_0);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_0);

  //Set up the SPI pins
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIO_InitStruct);

  //Set up the SPI peripheral
  SPI_InitStruct.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStruct.SPI_Mode = SPI_Mode_Master;
  SPI_InitStruct.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStruct.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStruct.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStruct.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32;
  SPI_InitStruct.SPI_FirstBit = SPI_FirstBit_MSB;

