mhoikka/RCtransmitter_stm32f0/src/Peripheral_Init.c
  SPI1->CR2 |= SPI_CR2_FRXTH; // RXNE event is generated if the FIFO level is greater than or equal to 8

  //Initialize the SPI peripheral
  SPI_Init(SPI1, &SPI_InitStruct);
  SPI_Cmd(SPI1, ENABLE);
}

/** 
 * @brief Initialize the NRF24L01+ module
 * @retval None
*/
void NRF24L01p_Init(){
  //Set up the SPI peripheral
  MySPI_Init();

  //Set up the GPIO pins
  GPIO_InitTypeDef GPIO_InitStruct_1;
  //Set up the CSN pin
  GPIO_InitStruct_1.GPIO_Pin = GPIO_Pin_4;
  GPIO_InitStruct_1.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct_1.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct_1.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct_1.GPIO_PuPd = GPIO_PuPd_DOWN; 
  GPIO_Init(GPIOA, &GPIO_InitStruct_1);

  GPIO_InitTypeDef GPIO_InitStruct_2;
  //Set up the IRQ pin
  GPIO_InitStruct_2.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStruct_2.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct_2.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct_2.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStruct_2.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(GPIOA, &GPIO_InitStruct_2);

   GPIO_InitTypeDef GPIO_InitStruct_3;
  //Set up the CE pin
  GPIO_InitStruct_3.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStruct_3.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct_3.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct_3.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct_3.GPIO_PuPd = GPIO_PuPd_DOWN; 
  GPIO_Init(GPIOA, &GPIO_InitStruct_3);
}

/**
 * @brief Initializes the UART connection for the STM32F030R8
 * @retval None
 */
void UART_Settings_Init(){
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_1);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_1);

  GPIO_InitTypeDef GPIO_InitStruct;

  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz; 
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP; 
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL; 
  GPIO_Init(GPIOA, &GPIO_InitStruct);


  USART_InitTypeDef USART_InitStruct;
  USART_InitStruct.USART_BaudRate = 9600;
  USART_InitStruct.USART_WordLength = USART_WordLength_8b;
  USART_InitStruct.USART_StopBits = USART_StopBits_1;
  USART_InitStruct.USART_Parity = USART_Parity_No;
  USART_InitStruct.USART_Mode = USART_Mode_Tx;
  USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_Init(USART2, &USART_InitStruct);
  //No synchronous mode yet
  USART_Cmd(USART2, ENABLE);
}

  /**
   * @brief Sets up ICM20948 for data collection and puts magnetometer(AK09916) into continuous mode 4 (100 Hz data rate)
   * @param None
   * @retval N0ne
   */
  void ICM20948_init(){
    
    I2C_transmit(ICM_20948_I2C_ADDRESS, REG_BANK_SEL, USER_BANK_0); // switch to USER BANK 0

    I2C_transmit(ICM_20948_I2C_ADDRESS, LP_CONFIG, 0x30); // set low power mode for ICM20948 (ACCEL/ GYRO in duty cycle mode)

    I2C_transmit(ICM_20948_I2C_ADDRESS, PWR_MGMT_1, 0x11); // set low power enable for digital circuitry (does not turn on LP mode, use LP_CONFIG) and auto clock select for ICM20948
    I2C_transmit(ICM_20948_I2C_ADDRESS, PWR_MGMT_2, 0x00); // enable accelerometer and gyroscope for ICM20948

    I2C_transmit(ICM_20948_I2C_ADDRESS, REG_BANK_SEL, USER_BANK_2); // switch to USER BANK 2
  
    I2C_transmit(ICM_20948_I2C_ADDRESS, TEMP_CONFIG, 0x01); // set TEMP_DLPCFG for temperature sensor to 1

    I2C_transmit(ICM_20948_I2C_ADDRESS, GYRO_SMPLRT_DIV, 0x07); // set gyro sample rate divider to 7 for ICM20948
    I2C_transmit(ICM_20948_I2C_ADDRESS, GYRO_CONFIG_1, 0x3F); // Set gyro +- range to 2000dps and DLPF 3dB point to 361 Hz, and enable LPF for ICM20948
    I2C_transmit(ICM_20948_I2C_ADDRESS, GYRO_CONFIG_2, 0x02); // Enable 4x averaging for gyro data for ICM20948

    I2C_transmit(ICM_20948_I2C_ADDRESS, ACCEL_SMPLRT_DIV, 0x0A); // set accel sample rate divider to 10 for ICM20948
    I2C_transmit(ICM_20948_I2C_ADDRESS, ACCEL_CONFIG, 0x3F); // Set accel +- range to 16g and DLPF 3dB point to 473 Hz, and enable LPF for ICM20948
    I2C_transmit(ICM_20948_I2C_ADDRESS, ACCEL_CONFIG_2, 0x00); // Enable 4x averaging for accel data for ICM20948

    I2C_transmit(ICM_20948_I2C_ADDRESS, REG_BANK_SEL, USER_BANK_0); // switch to USER BANK 0

    // Enable bypass mode for I2C access of internal magnetometer
    I2C_transmit(ICM_20948_I2C_ADDRESS, 0x0F, 0x02);  // INT_PIN_CFG: BYPASS_EN = 1

    I2C_transmit(0x0C, 0x31, 0x08);  // CNTL2 register = 0x16 (continuous 100 Hz updates to magnetometer data)
    delay_microseconds(10*1000, NULL); // TODO find out how long the magnetometer needs to start up
  }

/**
 * @brief Constructs control packet for receiver PCB
  * @param uint8_t * joystick: Array of 4 joystick values, each 1 byte
  * @param uint8_t servos: byte for servo control signals (max 8)
  * @param uint8_t * predictions: Array of 4 predicted values, each 1 byte
  * @param uint8_t checksum: byte for error checking
  * @param *uint8_t control_packet: Control packet to be constructed, up to 32 bytes
  * @retval None
 */
void makeControlSignal(uint8_t * joystick, uint8_t servos, uint8_t * predictions, uint8_t checksum, 
  uint8_t *control_packet){
  *control_packet = 0;
  *control_packet |= ((joystick[0] & 0xFF));
  *control_packet |= ((joystick[1] & 0xFF) << 8);
  *control_packet |= ((joystick[2] & 0xFF) << 16);
  *control_packet |= ((joystick[3] & 0xFF) << 24);
  *control_packet |= ((servos & 0x01) << 32);
  *control_packet |= ((servos & 0x02) << 33);
  *control_packet |= ((servos & 0x04) << 34);
  *control_packet |= ((servos & 0x08) << 35);
  *control_packet |= ((servos & 0x10) << 36);
  *control_packet |= ((servos & 0x20) << 37);
  *control_packet |= ((servos & 0x40) << 38);
  *control_packet |= ((servos & 0x80) << 39);
  *control_packet |= ((predictions[0] & 0xFF) << 40);
  *control_packet |= ((predictions[1] & 0xFF) << 48);
  *control_packet |= ((predictions[2] & 0xFF) << 56);
  *control_packet |= ((predictions[3] & 0xFF) << 64);
  *control_packet |= ((checksum & 0xFF) << 72);
} // Not using all of packet space at the moment (max 32 bytes)
// TODO write code for predicted_gyroscope, predicted_accelerometer, predicted_magnetometer, predicted_distance values
// TODO Untested



/**
 * @brief Collects ambient data from ICM20948 and puts it into the provided array ICM_data
 * @param float * ICM_data  Array to store the collected data
 * @retval None
 */
  void getICM20948_ACCEL_GYRO_TEMPdata(float * ICM_data){ // TODO switch to using ADC_take_Multiple_Readings
    static float ACCEL_SENSITIVITY = 2048;
    static float GYRO_SENSITIVITY = 16.4; 
    static float MAG_SENSITIVITY = 0.15;
    static float TEMP_SENSITIVITY = 337.87; 

    // Accelerometer and Gyroscope variables
    uint8_t accel_gyro_data[14];
    float accel_out[3]; //{X,Y,Z}
    float gyro_out[3]; //{X,Y,Z}

    // Magnetometer variables
    int16_t mag_raw[3];
    float mag_out[3];
    uint8_t buf[6];
    uint8_t new_magdata = 0;
    uint8_t mag_overf = 0;
    uint8_t st1 = 0;
    uint8_t st2 = 0; 

      // Read accelerometer and gyroscope data test
    I2C_receive(ICM_20948_I2C_ADDRESS, GYRO_ACCEL_START_REG, accel_gyro_data, 14); // read ACCEL_XOUT_H register and the following 11 registers for accel and gyro data

    // Thermometer variables
    float temp_out = (((accel_gyro_data[12] << 8) + accel_gyro_data[13] - 0) / TEMP_SENSITIVITY) + 21; // Degrees Celcius

    accel_out[0] = ((accel_gyro_data[0] << 8) + accel_gyro_data[1]) / ACCEL_SENSITIVITY * 9.81; // TODO adjust gyro and accelerometer data for temperature drift values
    accel_out[1] = ((accel_gyro_data[2] << 8) + accel_gyro_data[3]) / ACCEL_SENSITIVITY * 9.81; // m/s^2 // TODO reading very high m(309.6 m/s^2), bug?
    accel_out[2] = ((accel_gyro_data[4] << 8) + accel_gyro_data[5]) / ACCEL_SENSITIVITY * 9.81; // m/s^2

    gyro_out[0] = (accel_gyro_data[6] * UINT8_MAX + accel_gyro_data[7]) / GYRO_SENSITIVITY; // Degrees per second
    gyro_out[1] = (accel_gyro_data[8] * UINT8_MAX + accel_gyro_data[9]) / GYRO_SENSITIVITY; // Degrees per second
    gyro_out[2] = (accel_gyro_data[10] * UINT8_MAX + accel_gyro_data[11]) / GYRO_SENSITIVITY; // Degrees per second

