mhoikka/RCtransmitter_stm32f0/src/Peripheral_Init.c
    temp_out = (((accel_gyro_data[12] << 8) + accel_gyro_data[13] - 0) / TEMP_SENSITIVITY) + 21; // Degrees Celcius

    // BANK 0: Enable I2C master
    // Should still be in BANK 0
    
    do {
      I2C_receive(0x0C, 0x10, &st1, 1);  // read ST1
    } while (!(st1 & 0x01)); // Wait for DRDY flag
    I2C_receive(0x0C, MAG_START_REG, buf, 6); // 0x0C I2C address is for the internal magnetometer
    I2C_receive(0x0C, 0x18, &st2, 1);  // read ST2 // TODO handle overflow flags here 

    // Now interpret:
    mag_raw[0] = (int16_t)((buf[1] << 8) | buf[0]); // X
    mag_raw[1] = (int16_t)((buf[3] << 8) | buf[2]); // Y
    mag_raw[2] = (int16_t)((buf[5] << 8) | buf[4]); // Z

    // ST1 check (data ready)
    if(!(st1 & 0x01)) {
        // TOD0 No new data; skip using this sample
        new_magdata = 0; 
    }

    // ST2 check (overflow)
    if(st2 & 0x08) {
        // TODO Magnetic overflow — discard values
        mag_overf = 1;
    }

    mag_out[0] = mag_raw[0] * MAG_SENSITIVITY; // uT
    mag_out[1] = mag_raw[1] * MAG_SENSITIVITY; // uT
    mag_out[2] = mag_raw[2] * MAG_SENSITIVITY; // uT

    ICM_data[0] = accel_out[0];
    ICM_data[1] = accel_out[1];
    ICM_data[2] = accel_out[2];
    ICM_data[3] = gyro_out[0];
    ICM_data[4] = gyro_out[1];
    ICM_data[5] = gyro_out[2];
    ICM_data[6] = temp_out;
    ICM_data[7] = mag_out[0];
    ICM_data[8] = mag_out[1];
    ICM_data[9] = mag_out[2];
  }

/**
 * @brief Convert 4x 16 bit ADC readings to 8 bit scaled ADC output for transmission 
 * @param uint16_t * adc_controller_values: The 16 bit ADC values to convert, from vertical and horizontal axes of both joysticks (4 entries)
 * @param uint8_t *_8bit_values: The 8 bit ADC values after conversion
 * @retval None
 */
void ADC_convert_to_8bit_controls(uint16_t *adc_controller_values, uint8_t *_8bit_values)
{
    // Scale down the 16 bit ADC value to 8 bits
    for (int i = 0; i < 4; i++) {
        uint8_t downscaledADC_Reading = (uint8_t)(adc_controller_values[i] >> 8);
        adc_controller_values[i] = downscaledADC_Reading; // TODO add the real conversion process in here
    }
    return;
} // TODO test this 

/**
 * @brief Generate predictions for aircraft sensor readings and distance
 * @param uint16_t *sensor_data: Pointer to the array containing last sensor readings
 * @param uint16_t *predictions: Pointer to the array to store predicted values for accelerometer, distance, magnetometer, and gyroscope
 * @retval None
 */
void generate_predictions(uint16_t *sensor_data, uint16_t *predictions, uint8_t length)
{
    // TODO alter global variable containing last extrapolated position data
    return; // TODO implement prediction algorithm
}

/**
 * @brief Takes a single ADC reading from all indicated channels
 * @param uint16_t ADC_channel: The ADC channels to read from, with each channel's status indicated by a 1 or 0 in the respective bit position
 * @param uint16_t *adc: pointer to array to store ADC readings, 15 uint16_t long
 * @retval None
 */
uint16_t ADC_take_Multiple_Readings(uint16_t ADC_channels, uint16_t *adc){ // TODO untested

  // make sure ADC peripheral clock was enabled earlier:
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE); // safe to call if already enabled, only one ADC 
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);  // enable all GPIO peripherals, TODO be more efficient here
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);  
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);  

  // Configure selected pins as analog inputs
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.GPIO_Pin = ADC_channels & 0x00FF; // Status of all channels is indicated by bits in the respective position in the uint16_t variable
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP; // kept from existing style
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIO_InitStruct);

  // Configure selected pins as analog inputs
  GPIO_InitTypeDef GPIO_InitStruct2;
  GPIO_InitStruct2.GPIO_Pin = ADC_channels & 0x0300; // Status of all channels is indicated by bits in the respective position in the uint16_t variable
  GPIO_InitStruct2.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStruct2.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct2.GPIO_OType = GPIO_OType_PP; // kept from existing style
  GPIO_InitStruct2.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOB, &GPIO_InitStruct);

  // Configure selected pins as analog inputs
  GPIO_InitTypeDef GPIO_InitStruct3;
  GPIO_InitStruct3.GPIO_Pin = ADC_channels & 0xFC00; // Status of all channels is indicated by bits in the respective position in the uint16_t variable
  GPIO_InitStruct3.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStruct3.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct3.GPIO_OType = GPIO_OType_PP; // kept from existing style
  GPIO_InitStruct3.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOC, &GPIO_InitStruct3);

  // Enable ADC and wait until ADEN is set
  ADC_Cmd(ADC1, ENABLE);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_ADEN) == RESET) {
    /* wait for ADC ready */
  }

  // Configure the chosen channels for a long sample time
  for(uint8_t pos = 0; pos < 16; pos++){
    if((ADC_channels >> pos) & 0x1){
      ADC_ChannelConfig(ADC1, 0x01<<pos, ADC_SampleTime_239_5Cycles);
    }
  }

  // Start conversion and wait for completion
  ADC_StartOfConversion(ADC1);

 for(uint8_t pos = 0; pos < 16; pos++){
    if(ADC_channels>>pos & 0x1){
      while (!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));
      adc[pos] = ADC_GetConversionValue(ADC1); // TODO does this scan all channels or does it need to be manually switched?
    }
  }

  // Clear EOC flag (safe to do)
  ADC_ClearFlag(ADC1, ADC_FLAG_EOC);

  return;
}